{
  "code": "HOLLAND",
  "name": "Mô tả 6 nhóm sở thích Holland (RIASEC)",
  "description": "Dùng để diễn giải kết quả sau khi tính điểm. Kết quả Holland thường là 2-3 nhóm có điểm số cao nhất.",
  "results": [
    { "code": "A", "level": "Kỹ thuật (Realistic)", "description": "Yếu tố di truyền và kinh nghiệm của nhóm Kỹ thuật dẫn đến sự ưu tiên cho các hoạt động đòi hỏi sự tương tác với các đồ vật, công cụ, máy móc và động vật một cách rõ ràng, có trật tự hoặc có hệ thống. Nhóm này không có thiện cảm với các hoạt động giáo dục hoặc trị liệu. Những khuynh hướng hành vi này dẫn đến việc thu được các năng lực thủ công, cơ khí, nông nghiệp, điện và kỹ thuật và thiếu hụt các năng lực xã hội và giáo dục." },
    { "code": "B", "level": "Nghiên cứu (Investigative)", "description": "Yếu tố di truyền và kinh nghiệm của nhóm Nghiên cứu dẫn đến việc ưu tiên cho các hoạt động đòi hỏi sự điều tra các hiện tượng vật lý, sinh học và văn hóa theo phương pháp quan sát, tượng trưng, có hệ thống và sáng tạo để hiểu và kiểm soát các hiện tượng đó. Nhóm này không có thiện cảm với các hoạt động thuyết phục, giao tiếp và lặp đi lặp lại. Những khuynh hướng hành vi này dẫn đến việc thu được các năng lực khoa học và toán học và thâm hụt các năng lực thuyết phục." },
    { "code": "C", "level": "Nghệ thuật (Artistic)", "description": "Yếu tố di truyền và kinh nghiệm của nhóm Nghệ thuật dẫn đến việc ưu tiên cho các hoạt động chưa rõ ràng, tự do, chưa được hệ thống hóa. Các hoạt động này đòi hỏi sự vận dụng các vật liệu vật lý, qua ngôn ngữ nói, hoặc liên quan đến con người để tạo ra các hình thức hoặc sản phẩm nghệ thuật. Nhóm này không có thiện cảm với các hoạt động rõ ràng, có hệ thống và theo yêu cầu. Những khuynh hướng hành vi trên dẫn đến việc thu được các năng lực nghệ thuật - ngôn ngữ, nghệ thuật, âm nhạc, kịch, viết - và sự thiếu hụt trong năng lực thuộc về hành chính hoặc hệ thống kinh doanh." },
    { "code": "D", "level": "Xã hội (Social)", "description": "Yếu tố di truyền và kinh nghiệm của nhóm Xã hội dẫn đến việc ưu tiên cho các hoạt động đòi hỏi làm việc với người khác để thông báo, huấn luyện, phát triển, chữa lành hoặc giác ngộ. Nhóm này không có thiện cảm với các hoạt động rõ ràng, có trật tự, có hệ thống liên quan đến vật liệu, công cụ hoặc máy móc. Những khuynh hướng hành vi này dẫn đến việc thu được các khả năng liên quan đến con người như năng lực giao tiếp giữa các cá nhân và năng lực liên quan đến giáo dục – cũng như sự thiếu hụt các năng lực thuộc về thủ công và kỹ thuật." },
    { "code": "E", "level": "Quản lý (Enterprising)", "description": "Yếu tố di truyền và kinh nghiệm của nhóm Quản lý dẫn đến sự ưu tiên cho các hoạt động đòi hỏi sự ảnh hưởng và chi phối lên người khác để đạt được các mục tiêu của tổ chức hoặc lợi ích kinh tế. Nhóm này không có thiện cảm với các hoạt động quan sát, tượng trưng và hệ thống. Những khuynh hướng hành vi này dẫn đến việc thu được các năng lực lãnh đạo, giao tiếp giữa các cá nhân và thuyết phục cũng như sự thiếu hụt các năng lực khoa học." },
    { "code": "F", "level": "Nghiệp vụ (Conventional)", "description": "Yếu tố di truyền và kinh nghiệm của nhóm Nghiệp vụ dẫn đến sự ưu tiên cho các hoạt động đòi hỏi phải xử lý dữ liệu rõ ràng, có trật tự, có hệ thống. Ví dụ cụ thể là việc lưu giữ hồ sơ, lưu trữ tài liệu, sao chép tài liệu, sắp xếp dữ liệu văn bản và dữ liệu số theo kế hoạch quy định, điều hành máy kinh doanh cũng như máy xử lý dữ liệu để đạt được các mục tiêu kinh tế hoặc mục tiêu tổ chức. Nhóm này không có thiện cảm với các hoạt động mơ hồ, tự do, thăm dò hoặc không hệ thống hóa." }
  ]
}